pennam/ArduinoCore-zephyr/boards.txt
menu.debug=Debug
menu.mode=Mode

giga.name=Arduino Giga R1
giga.build.core=arduino
giga.build.crossprefix=arm-zephyr-eabi-
giga.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

giga.menu.debug.false=Standard
giga.menu.debug.true=Debug

giga.menu.debug.false.postbuild_debug=
giga.menu.debug.true.postbuild_debug=-debug

giga.build.zephyr_target=arduino_giga_r1//m7
giga.build.zephyr_args=--shield arduino_giga_display_shield
giga.build.zephyr_hals=hal_stm32
giga.build.variant=arduino_giga_r1_stm32h747xx_m7
giga.build.mcu=cortex-m7
giga.build.fpu=-mfpu=fpv5-d16
giga.build.architecture=cortex-m7
giga.compiler.zephyr.arch.define=-DCORE_CM7

giga.build.float-abi=-mfloat-abi=softfp
giga.build.extra_flags=
giga.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
giga.build.architecture=cortex-m7
giga.build.board=ARDUINO_GIGA
giga.compiler.zephyr=
giga.vid.0=0x2341
giga.pid.0=0x0066
giga.upload_port.0.vid=0x2341
giga.upload_port.0.pid=0x0066

giga.upload.tool=dfu-util
giga.upload.tool.default=dfu-util
giga.upload.protocol=
giga.upload.transport=
giga.upload.vid=0x2341
giga.upload.pid=0x0366
giga.upload.interface=0
giga.upload.use_1200bps_touch=true
giga.upload.wait_for_upload_port=true
giga.upload.native_usb=true
giga.upload.maximum_size=1966080
giga.upload.maximum_data_size=523624

giga.upload.address=0x080E0000

giga.upload.maximum_size=786432
giga.upload.maximum_data_size=523624

giga.bootloader.tool=dfu-util
giga.bootloader.tool.default=dfu-util
giga.bootloader.vid=0x2341
giga.bootloader.pid=0x0366
giga.bootloader.interface=0
giga.bootloader.file=zephyr-{build.variant}.bin
giga.bootloader.address=0x08040000

giga.debug.tool=gdb
giga.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
giga.debug.server.openocd.scripts.1={programmer.transport_script}
giga.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
giga.debug.cortex-debug.custom.request=attach
giga.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##########################################################################################

nano33ble.name=Arduino Nano 33 BLE
nano33ble.build.core=arduino
nano33ble.build.crossprefix=arm-zephyr-eabi-
nano33ble.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

nano33ble.menu.debug.false=Standard
nano33ble.menu.debug.true=Debug

nano33ble.menu.debug.false.postbuild_debug=
nano33ble.menu.debug.true.postbuild_debug=-debug

nano33ble.build.zephyr_target=arduino_nano_33_ble//sense
nano33ble.build.zephyr_args=
nano33ble.build.zephyr_hals=hal_nordic
nano33ble.build.variant=arduino_nano_33_ble_nrf52840_sense
nano33ble.build.mcu=cortex-m4
nano33ble.build.fpu=-mfpu=fpv4-sp-d16
nano33ble.build.architecture=cortex-m4
nano33ble.compiler.zephyr.arch.define=

nano33ble.build.float-abi=-mfloat-abi=hard
nano33ble.build.extra_flags=
nano33ble.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano33ble.build.architecture=cortex-m4
nano33ble.build.board=ARDUINO_NANO33BLE
nano33ble.compiler.zephyr=
nano33ble.vid.0=0x2341
nano33ble.pid.0=0x035a
nano33ble.upload_port.0.vid=0x2341
nano33ble.upload_port.0.pid=0x005a

nano33ble.upload.tool=bossac
nano33ble.upload.tool.default=bossac
nano33ble.upload.protocol=
nano33ble.upload.transport=
nano33ble.upload.vid=0x2341
nano33ble.upload.pid=0x005a
nano33ble.upload.interface=0
nano33ble.upload.use_1200bps_touch=true
nano33ble.upload.wait_for_upload_port=true
nano33ble.upload.native_usb=true
nano33ble.upload.maximum_size=1966080
nano33ble.upload.maximum_data_size=523624
nano33ble.upload.address=0xD0000

nano33ble.upload.maximum_size=786432
nano33ble.upload.maximum_data_size=523624

nano33ble.bootloader.tool=bossac
nano33ble.bootloader.tool.default=bossac
nano33ble.bootloader.vid=0x2341
nano33ble.bootloader.pid=0x035b
nano33ble.bootloader.interface=0
nano33ble.bootloader.file=zephyr-{build.variant}.bin
nano33ble.bootloader.address=0x0000

nano33ble.debug.tool=gdb
nano33ble.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nano33ble.debug.server.openocd.scripts.1={programmer.transport_script}
nano33ble.debug.server.openocd.scripts.2=target/nrf52.cfg
nano33ble.debug.cortex-debug.custom.request=attach

##############################################################################################################

ek_ra8d1.name=EK_RA8D1
ek_ra8d1.build.core=arduino
ek_ra8d1.build.crossprefix=arm-zephyr-eabi-
ek_ra8d1.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

ek_ra8d1.menu.debug.false=Standard
ek_ra8d1.menu.debug.true=Debug

ek_ra8d1.menu.debug.false.postbuild_debug=
ek_ra8d1.menu.debug.true.postbuild_debug=-debug

ek_ra8d1.build.zephyr_target=ek_ra8d1
ek_ra8d1.build.zephyr_args=
ek_ra8d1.build.zephyr_hals=hal_renesas
ek_ra8d1.build.variant=ek_ra8d1_r7fa8d1bhecbd
ek_ra8d1.build.mcu=cortex-m85+nomve
ek_ra8d1.build.fpu=-mfpu=fpv5-d16
ek_ra8d1.build.architecture=cortex-m85+nomve
ek_ra8d1.compiler.zephyr.arch.define=

ek_ra8d1.build.float-abi=-mfloat-abi=hard
ek_ra8d1.build.extra_flags=
ek_ra8d1.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
ek_ra8d1.build.architecture=cortex-m85+nomve
ek_ra8d1.build.board=EK_RA8D1
ek_ra8d1.compiler.zephyr.arch.define=

#ek_ra8d1.recipe.hooks.objcopy.postobjcopy.4.pattern=cp {build.variant.path}/flasher.jlink "{build.path}/flasher.jlink"
#ek_ra8d1.recipe.hooks.objcopy.postobjcopy.5.pattern=sed -i 's|SKETCH|"{build.path}/{build.project_name}.llext.dfu.bin"|g' "{build.path}/flasher.jlink"

ek_ra8d1.compiler.zephyr=
ek_ra8d1.vid.0=0x2341
ek_ra8d1.pid.0=0x0077
ek_ra8d1.upload_port.0.vid=0x2341
ek_ra8d1.upload_port.0.pid=0x0077

ek_ra8d1.upload.tool=pyocd
ek_ra8d1.upload.tool.default=pyocd
ek_ra8d1.upload.protocol=
ek_ra8d1.upload.transport=
ek_ra8d1.upload.vid=0x2341
ek_ra8d1.upload.pid=0x0366
ek_ra8d1.upload.interface=0
ek_ra8d1.upload.use_1200bps_touch=false
ek_ra8d1.upload.wait_for_upload_port=false
ek_ra8d1.upload.native_usb=true
ek_ra8d1.upload.maximum_size=1966080
ek_ra8d1.upload.maximum_data_size=523624
ek_ra8d1.upload.address=0x2032000
ek_ra8d1.upload.target=R7FA8D1AH

ek_ra8d1.bootloader.tool=pyocd
ek_ra8d1.bootloader.tool.default=pyocd
ek_ra8d1.bootloader.file=zephyr-{build.variant}.elf
ek_ra8d1.bootloader.target=R7FA8D1AH


##############################################################################################################

frdm_mcxn947.name=MCXN947
frdm_mcxn947.build.core=arduino
frdm_mcxn947.build.crossprefix=arm-zephyr-eabi-
frdm_mcxn947.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

frdm_mcxn947.menu.debug.false=Standard
frdm_mcxn947.menu.debug.true=Debug

